import provider_fa from "./provider/fa"
import author_fa from "./author/fa"

const global_fa = {
  // global
  aimoonhub: "آیمون‌هاب",

  // header
  home: "صفحه اصلی",
  about_us: "درباره ما",
  contact_us: "ارتباط با ما",
  features: "ویژگی ما",
  prices: "قیمت ها",
  support: "پشتیبانی",
  login_telegram: "ورود به ربات تلگرام",

  // welcome
  welcome_title:
    "تحلیل لحظه‌ای اخبار <0>{{financial_markets}}</0> و <1>{{cryptocurrencies}}</1>",
  financial_markets: "بازارهای مالی",
  cryptocurrencies: "رمز ارزها",
  welcome_description:
    "آیمون‌هاب با استفاده از هوش مصنوعی، اخبار و داده‌های بازار را در لحظه تحلیل کرده و اطلاعاتی دقیق برای تصمیم‌گیری بهتر به شما ارائه می‌دهد",
  welcome_title_2: "ابزار هوشمند تحلیل اخبار کریپتو!",
  welcome_description_2:
    " با دقتی فراتر از انسان، جدیدترین اخبار و تحولات دنیای رمزارزها را بررسی کن. داده‌های لحظه‌ای، تحلیل‌های دقیق و بینشی عمیق برای تصمیم‌گیری بهتر در بازارهای مالی!",

  // why aimoonhub
  free_test_aimoonex: "تست رایگان",
  why_aimoonhub_description: "آیمون هاب - تحلیل هوشمند اخبار ترید در لحظه",
  why_aimoonhub_slogan:
    "یک قدم جلوتر از بازار باشید! با تحلیل‌های هوشمند ایمون هاب، تأثیر اخبار بر معاملات خود را سریع‌تر از دیگران درک کنید و تصمیم‌های آگاهانه بگیرید",
  login_dashboard: "ورود به داشبورد",
  why_aimoonhub_title: "چرا ایمون هاب؟ ویژگی‌های منحصربه‌فرد ما",
  feature_box_1_title: "تحلیل اخبار مبتنی بر AI",
  feature_box_1_description:
    "جمع‌آوری اخبار از منابع معتبر و تحلیل تاثیر آن‌ها بر بازار کریپتو",
  feature_box_2_title: "تحلیل خودکار کوین‌ها",
  feature_box_2_description:
    "بررسی روندهای قیمتی و رفتار بازار با استفاده از الگوریتم‌های پیشرفته",
  feature_box_3_title: "داشبورد هوشمند برای خبرنگاران",
  feature_box_3_description:
    "ارائه داده‌های دقیق برای خبرنگاران و معامله‌گران حرفه‌ای",

  // how to work
  how_to_work_aimoonhub: "آیمون هاب چگونه کار میکند؟",
  step_box_1_title: "جمع‌آوری لحظه‌ای خبر",
  step_box_2_title: "پردازش و تحلیل با هوش مصنوعی",
  step_box_3_title: "نمایش نتیجه در تلگرام",
  step_box_4_title: "داشبورد حرفه‌ای برای کاربران پبشرفته",

  step_box_1_text: "بات به‌صورت خودکار از بیش لز 1000  منابع خبری معتبر داده‌ها رو دریافت می‌کنه.(مثلاً سایت‌های خبری کر یپتو، توییتر، ردیت و ...)",

  step_box_2_text: "بعد از پردازش، نتیجه تحلیل مستقیم توی تلگرام کاربر ارسال می‌شه:",
  step_box_2_text_check_1: " خلاصه خبر + تحلیل احساسات",
  step_box_2_text_check_2: "هشدارها (مثلاً نوسان شدید روی یه کوین خاص)",
  step_box_2_text_check_3: "لینک منبع خبر برای مطالعه کام",
  step_box_2_text_check_4: "تحلیل خبر جفت ارزهای مهم در ساعات تعریف شده",

  step_box_3_text: "با استفاده از مدل پیریخته زبانی و تحلیل احساس اخبار تحلیل می‌شود:",
  step_box_3_text_check_1: "بررسی احساسات (مثبت، منفی، خنثی)",
  step_box_3_text_check_2: "تشخیص اخبار فیک یا شایعه",
  step_box_3_text_check_3: "تحلیل ارتباط خبر با کوین‌های مهم",
  step_box_3_text_check_4: "ارائه تحلیل مود خبر",


  step_box_4_text: "کاربران پلن‌های پولی، می‌تونن توی داشبورد وب جزئیات بیشتری ببینن:",
  step_box_4_text_check_1: " نمودارهای تحلیل روند خبرها",
  step_box_4_text_check_2: " مشاهده سوابق تحلیل‌ها",
  step_box_4_text_check_3: " فیلترهای سفارشی برای دریافت اخبار خاص",
  step_box_4_text_check_4: " ارائه داشبورد خبرگزاری",
  step_box_4_text_check_5: " ارائه داشبورد خبرنگار",

  // aimoonhub statistics
  aimoonhub_statistics_slogan: "شفاف و دقیق | آمارهای ایمون هاب",
  count_agencies: "تعداد خبرگزاری ها",
  count_analyses: "تعداد تحلیل‌ها",
  count_reporters: "تعداد خبرنگاران",
  count_aimoonhub_users: "تعداد کاربران آیمون‌هاب",
  financial_chart_currency_pairs_prices: "نمودار مالی قیمت جفت ارزها",
  count_news: "تعداد خبرهای موجود در بانک اطلاعاتی",

  // customer reviews
  our_customer_reviews: "نظرات مشتریان ما",
  all_reviews: "دیدن تمام <0>{{count}}</0> نظر",
  count_reviews: "<0>{{count}}</0> نفر به آیمون هاب نظر مثبت داده اند",


  name_1: "علی نظری",
  occupation_1: "معامله‌گر ارز دیجیتال",
  review_1: "ایمون هاب واقعاً یک ابزار ضروری برای هر معامله‌گر است. با تحلیل سریع و دقیق اخبار، باعث شد بتوانم تصمیمات معاملاتی بهتری بگیرم و سودم را افزایش دهم!",

  name_2: "سارا احمدی",
  occupation_2: "سرمایه‌گذار بلندمدت",
  review_2: "پیگیری اخبار مهم بازار همیشه برایم سخت بود، اما با ایمون هاب همه چیز ساده‌تر شده است. حالا بدون نگرانی می‌توانم به اطلاعات کلیدی دسترسی داشته باشم و استراتژی‌های سرمایه‌گذاری‌ام را بهبود دهم.",

  name_3: "محمد کریمی",
  occupation_3: "تحلیلگر تکنیکال",
  review_3: "تحلیل تکنیکال به تنهایی کافی نیست؛ اخبار تأثیر زیادی روی بازار دارند. ایمون هاب به من کمک کرده تا بهتر متوجه شوم که چه اخباری ممکن است روند بازار را تغییر دهد!",

  // plans
  plans_title: "پلن‌های اشتراک، مناسب برای هر سبک معاملاتی",
  free: "رایگان",
  base_plan: "پکیج پایه",
  professional_plan: "پکیج حرفه‌ای",
  vanguard_plan: "پکیج پیشتاز",
  bot_telegram: "بات تلگرام",
  user_aimoonhub: "کاربر آیمون هاب",
  news_analysis: "تحلیل خبر",
  coins_analysis: "تحلیل کوین",
  news_dashboard: "داشبورد خبرگذاری",
  reporter_dashboard: "داشبورد خبرنگار",
  free_test: "تست رایگان",
  buy: "خرید",
  free_description: "تصمیمات تریدت رو هوشمند کن – الان شروع کن!",
  professional_description:
    "یک قدم جلوتر از بازار! تحلیل عمیق و بینش حرفه‌ای برای تریدرهای باهوش",
  vanguard_description:
    "تمام ابزارهای حرفه‌ای در دستان شما! از اخبار تا تحلیل‌های دقیق، همه‌چیز را در یک پلتفرم داشته باشید",
  features: "ویژگی ها",
  plan_description:
    "با عضویت در پنل <0>{{aimoonex}}</0> می‌توانید به صورت رایگان از پکیج پیشتاز آیمون هاب برخوردار شوید",
  aimoonex: "آیمونکس",
  plan_slogan:
    "یک قدم جلوتر از بازار باشید! با تحلیل‌های هوشمند ایمون هاب، تأثیر اخبار بر معاملات خود را سریع‌تر از دیگران درک کنید و تصمیم‌های آگاهانه بگیرید",
  enter_email: "آدرس ایمیل خود را وارد کنید",
  register_aimoonex: "عضویت در آیمونیکس",

  // latest news
  latest_news: "آخرین اخبار",
  all_news: "دیدن تمام خبرها",
  read_more: "بیشتر بدانید",

  // faq
  faq: "سوالات متداول",

  question_1: "ایمون هاب دقیقا چگونه کار می‌کند؟",
  answer_1: "ایمون هاب یک ابزار تحلیل اخبار هوشمند بازار ارز دیجیتال است که با استفاده از هوش مصنوعی، اخبار مهم بازار را پردازش کرده و تأثیر احتمالی آن‌ها بر قیمت‌ها را تحلیل می‌کند. این اطلاعات در زمان واقعی از طریق تلگرام در اختیار شما قرار می‌گیرد.",

  question_2: "آیا استفاده از ایمون هاب رایگان است؟",
  answer_2: "ایمون هاب دارای نسخه رایگان با امکانات محدود است، اما برای دسترسی به ویژگی‌های پیشرفته مانند تحلیل عمیق‌تر و سیگنال‌های اختصاصی، می‌توانید اشتراک حرفه‌ای یا پریمیوم خریداری کنید.",

  question_3: "ایمون هاب چگونه اخبار را تحلیل می‌کند؟",
  answer_3: "ایمون هاب با جمع‌آوری اخبار از منابع معتبر، اطلاعات را با الگوریتم‌های یادگیری ماشین پردازش کرده و میزان تأثیرگذاری آن‌ها بر بازار را ارزیابی می‌کند. سپس، نتایج تحلیل‌شده برای کمک به تصمیم‌گیری سریع در اختیار کاربران قرار می‌گیرد.",

  question_4: "چگونه می‌توان اشتراک حرفه‌ای یا پریمیوم را خریداری کرد؟",
  answer_4: "برای خرید اشتراک حرفه‌ای یا پریمیوم ایمون هاب، کافیست وارد وبسایت رسمی شده و از بخش «اشتراک‌ها» پلن مورد نظر خود را انتخاب کنید. همچنین، می‌توانید از طریق تلگرام و بخش پشتیبانی درخواست خرید ارسال کنید.",

  // contact us
  contact_us: "با ما در ارتباط باشید",
  title_contact_us:
    "یک قدم جلوتر از بازار باشید! با تحلیل هاس هوشمند آیمون هاب، تاثیر اخبار بر معاملات خود را سریع تر از دیگران درک کنید و تصمیم های آگاهانه بگیرید",
  name: "نام",
  last_name: "نام خانوادگی",
  email: "ایمیل",
  write_here_message: "پیام خود را در کادر زیر بنویسید",
  send: "ارسال",

  // footer
  address:
    "آدرس شرکت: مشهد، خیابان کوهسنگی، ملک الشعرا بهار ۵۶ ( خیابان شهید بهشتی )، شهید بهشتی ۷، پلاک ۴۷",
  phone: "تلفن",
  copyright: "کلیه حقوق محفوظ است",

  // dashboard

  register: "ثبت نام",
  login: "ورود",
  swipe_right: "به راست بکشید",
  swipe_left: "به چپ بکشید",
  coins_dashboard: "داشبورد کوین‌ها",
  authors_dashboard: "داشبورد خبرنگاران",
  providers_dashboard: "داشبورد خبرگزاری‌ها",
  news_analysis: "تحلیل اخبار",
  aimoon_analysis: "تحلیل آیمون",
  news: "اخبار",
  news_per_day: "اخبار در روز",
  news_per_week: "اخبار در هفته",
  news_per_month: "اخبار در ماه",
  news_base_statistics: "اخبار <0>{{name}}</0> بر اساس آمار",
  amount_changes: "میزان تغییرات",
  changes_emotions: "تغییرات احساسات",
  price_changes: "تغییرات قیمت",

  analyzed_news: "خبرهای تحلیل شده",

  // dashboard-coin

  coins_list: "لیست کوین‌ها",
  coin_list_title: "برای ورود به داشبورد کوین مورد نظر خود را انتخاب کنید",
  search_coin: "جستجو در کوین‌ها",
  news_count: "تعداد اخبار",

  coin_dashboard: "داشبورد کوین",
  all_information: "اطلاعات کلی",
  description: "توضیحات",
  word_cloud_coin: "نمودار ابر کلمات جفت ارز <0>{{name}} </0>",
  news_summary: " خلاصه خبر‌های <0>{{name}} </0>",
  chart_template: "الگوی چارت",
  aimoonhubs_suggestion: "پیشنهاد آیمون",
  duration: "مدت زمان",
  new_summary: "خلاصه خبر",
  change_from_yesterday: "تغییر نسبت به روز گذشته",
  change_from_last_week: "تغییر نسبت به هفته گذشته",
  change_from_last_month: "تغییر نسبت به ماه گذشته",
  current_price: "قیمت جاری",
  growth_last_day: "رشد نسبت به روز گذشته",
  price_last_day: "قیمت نسبت به روز گذشته",
  day_sentiments: "احساسات روزانه‌ی <0>{{name}}</>",
  week_sentiments: "احساسات هفتگی <0>{{name}}</>",
  out_of: "از <0>{{count}}</>",
  positive: "مثبت",
  negative: "منفی",
  neutral: "خنثی",
  sentiment: "احساس",
  mood_day: "مود روز",
  mood_week: "مود هفته",


  // authors
  author_list_title: "لیست نویسندگان",
  search_authors: "جستجوی نویسندگان",
  author_worked: "کار کرده",

  // providers
  provider_list_title: "لیست خبرگزاری‌ها",
  search_providers: "جستجوی خبرگزاری‌ها",
  provider_dec: "نویسندگان خبرگزاری",

  // date helper
  day_singular: "روز",
  day_plural: "روز",
  hour_singular: "ساعت",
  hour_plural: "ساعت",
  minute_singular: "دقیقه",
  minute_plural: "دقیقه",
  second_singular: "ثانیه",
  second_plural: "ثانیه",
  exactly_now: "همین الان",
  ago: "پیش",

  // settings
  persion: "فارسی",
  english: "انگلیسی",
  arabic: "عربی",
  light: "روشن",
  dark: "تیره",
}

const fa = {
  ...global_fa,
  ...provider_fa,
  ...author_fa,
};

export default fa;
